----------------- Создание таблиц базы данных -------------------------------
----			Будут созданы таблицы объектов
---- Опорная геологическая точка
---- Техногенный объект  
---- Природоохранный объект
---- 
---- Инцидент + разлив     

------------------------------------------------------------------------------
USE EGH;
GO;

DROP TABLE dbo.ОпорнаяГеологическаяТочка;
DROP TABLE dbo.ТехногенныйОбъект;
DROP TABLE dbo.ПриродоохранныйОбъект;
DROP TABLE dbo.Инцидент;

--- Создание таблицы -- Опорная Геологическая Точка
------------------------------------------------------------------------------------------------------
---------------------- Уточнить схему данных для точки!!!! Координаты!!!!!
------------------------------------------------------------------------------------------------------
CREATE TABLE [dbo].[ОпорнаяГеологическаяТочка](
	[КодОпорнойТочки] [int] NOT NULL,
	[КодТипаГрунта] [int] NOT NULL,
	[ГлубинаГрунтовыхВод] [float] NOT NULL,
	[ВысотаНадУровнемМоря] [float] NOT NULL,
	[КодНазначенияЗемель] [int] NOT NULL,
	[ОписаниеТочки] [nvarchar](150) NOT NULL,
	CONSTRAINT [PK_КодОпорнойТочки] PRIMARY KEY ([КодОпорнойТочки]))
GO

---- Вставка первоначальных данных в таблицу -- Опорная Геологическая Точка
INSERT INTO [dbo].[ОпорнаяГеологическаяТочка]
          ([КодОпорнойТочки],
           [КодТипаГрунта],
           [ГлубинаГрунтовыхВод],
           [ВысотаНадУровнемМоря],
           [КодНазначенияЗемель],
           [ОписаниеТочки])
     VALUES (1, 1, 0.7, 16.9, 1, 'Тестовая точка №1');
GO


--- Создание таблицы -- Техногенный объект
------------------------------------------------------------------------------------------------------
---------------------- Уточнить схему данных для Техногенного объекта!!!!
------------------------------------------------------------------------------------------------------
	--[Код_Объекта] [int] NOT NULL,
	--[Наименование_Объекта] [nvarchar](100) NOT NULL,
	--[Координаты_Объекта] [geography] NOT NULL,
	--[Дата_Открытия_Объекта] [date] NOT NULL,
	--[Код_Области] [int] NOT NULL,
	--[Код_Района] [int] NOT NULL,
	--[Точки] [nvarchar](max) NULL,
	--[Примечания] [nvarchar](max) NULL,
------------------------------------------------------------------------------------------------------
CREATE TABLE [dbo].[ТехногенныйОбъект](
	[КодТехногенногоОбъекта] [int] NOT NULL,
	[НаименованиеТехногенногоОбъекта] [nvarchar](50) NOT NULL,
	[КодТипаТехногенногоОбъекта] [int] NOT NULL,
 CONSTRAINT [PK_КодТехногенногоОбъекта] PRIMARY KEY ([КодТехногенногоОбъекта]))
GO

---- Вставка первоначальных данных в таблицу -- Техногенный объект
INSERT INTO [dbo].[ТехногенныйОбъект] ([КодТехногенногоОбъекта],[НаименованиеТехногенногоОбъекта],[КодТипаТехногенногоОбъекта]) VALUES(1,'АЗС-28', 1);
GO

---- Создание таблицы -- Природоохранный объект 
------------------------------------------------------------------------------------------------------
---------------------- Уточнить схему данных для природоохранного объекта!!!!
------------------------------------------------------------------------------------------------------
CREATE TABLE [dbo].[ПриродоохранныйОбъект](
	[КодПриродоохранногоОбъекта] [int] NOT NULL,
	[НаименованиеПриродоохранногоОбъекта] [nvarchar](50) NOT NULL,
	[КодТипаПриродоохранногоОбъекта] [int] NOT NULL,
 CONSTRAINT [PK_КодПриродоохранногоОбъекта] PRIMARY KEY ([КодПриродоохранногоОбъекта]))
GO

---- Вставка первоначальных данных в таблицу -- Природоохранные объекты
INSERT INTO [dbo].[ПриродоохранныйОбъект] ([КодПриродоохранногоОбъекта],[НаименованиеПриродоохранногоОбъекта],[КодТипаПриродоохранногоОбъекта]) VALUES(1,'Беловежская пуща', 3);
GO

---- Создание таблицы -- Инцидент
CREATE TABLE [dbo].[Инцидент](
	[КодИнцидента] [int] NOT NULL,
	[КодТипа] [int] NULL,
	[Дата] [datetime] NULL,
	[ДатаСообщения] [datetime] NULL,
	CONSTRAINT [PK_КодИнцидента] PRIMARY KEY ([КодИнцидента]));
GO

------------------------------------------------------------------------------------------------------
----- Возможны изменения структуры таблицы -----------------------------------------------------------
	--[КодИнцидента] [int] NOT NULL,
	--[ДатаПоступленияСообщения] [datetime2](7) NOT NULL,
	--[КодТипа] [int] NOT NULL,
	--[КодОбъекта] [int] NULL,
	--[ОбъемННП] [int] NOT NULL,
	--[ПогодныеУсловияТемпература] [int] NULL,
	--[Примечания] [nvarchar](max) NULL
------------------------------------------------------------------------------------------------------

---- Вставка первоначальных данных в таблицу -- Инцидент 
---------------------- Уточнить данные для вставки!!!!
INSERT INTO [dbo].[Инцидент]([КодТипа],[Дата],[ДатаСообщения]) VALUES ();
GO

