----------------- Создание таблиц базы данных -------------------------------
----			Будут созданы таблицы объектов
---- Геологическая точка
---- Техногенный объект  
---- Природоохранный объект
---- 
---- Инцидент + разлив     

------------------------------------------------------------------------------
USE EGH;
GO

DROP TABLE dbo.ГеологическаяТочка;
DROP TABLE dbo.ТехногенныйОбъект;
DROP TABLE dbo.ПриродоохранныйОбъект;
DROP TABLE dbo.Инцидент;

--- Создание таблицы -- Геологическая Точка
------------------------------------------------------------------------------------------------------
---------------------- Уточнить схему данных для точки!!!! Координаты!!!!!
------------------------------------------------------------------------------------------------------
CREATE TABLE [dbo].[ГеологическаяТочка](
	[КодГеологическойТочки] [int] NOT NULL,
	[ШиротаГрад] [float] NOT NULL,
	[ДолготаГрад] [float] NOT NULL,
	[ТипГрунта] [int] NOT NULL,
	[ГлубинаГрунтовыхВод] [float] NOT NULL,
	[ВысотаУровнемМоря] [float] NOT NULL,
 CONSTRAINT [PK_ГеологическаяТочка] PRIMARY KEY CLUSTERED ([КодГеологическойТочки]));
GO

ALTER TABLE [dbo].[ГеологическаяТочка]  WITH CHECK ADD CONSTRAINT [FK_ГеологическаяТочка_ТипГрунта] FOREIGN KEY([ТипГрунта])
REFERENCES [dbo].[ТипГрунта] ([КодТипаГрунта]);
GO

ALTER TABLE [dbo].[ГеологическаяТочка] CHECK CONSTRAINT [FK_ГеологическаяТочка_ТипГрунта];
GO

---- Вставка первоначальных данных в таблицу -- Опорная Геологическая Точка
INSERT INTO [dbo].[ГеологическаяТочка](
	[КодГеологическойТочки],
	[ШиротаГрад],
	[ДолготаГрад],
	[ТипГрунта],
	[ГлубинаГрунтовыхВод],
	[ВысотаУровнемМоря])
     VALUES (1, 0.7, 16.9, 1, 1.2, 12.7);
GO


--- Создание таблицы -- Техногенный объект
------------------------------------------------------------------------------------------------------
---------------------- Уточнить схему данных для Техногенного объекта!!!!
------------------------------------------------------------------------------------------------------
CREATE TABLE [dbo].[ТехногенныйОбъект](
	[КодТехногенногоОбъекта] [int] NOT NULL,
	[КодОпорнойТочки] [int] NOT NULL,
	[КодТипаТехногенногоОбъекта] [int] NOT NULL,
	[КодТипаНазначенияЗемель] [int] NOT NULL,
	[НаименованиеТехногенногоОбъекта] [nvarchar](max) NOT NULL,
	[АдресТехногенногоОбъекта] [nvarchar](max) NOT NULL,
 CONSTRAINT [PK_ТехногенныйОбъект] PRIMARY KEY CLUSTERED 
(
	[КодТехногенногоОбъекта] ASC
)WITH (PAD_INDEX = OFF, STATISTICS_NORECOMPUTE = OFF, IGNORE_DUP_KEY = OFF, ALLOW_ROW_LOCKS = ON, ALLOW_PAGE_LOCKS = ON) ON [PRIMARY]
) ON [PRIMARY] TEXTIMAGE_ON [PRIMARY]

GO

ALTER TABLE [dbo].[ТехногенныйОбъект]  WITH CHECK ADD  CONSTRAINT [FK_ТехногенныйОбъект_ГеологическаяТочка] FOREIGN KEY([КодОпорнойТочки])
REFERENCES [dbo].[ГеологическаяТочка] ([КодГеологическойТочки])
GO

ALTER TABLE [dbo].[ТехногенныйОбъект] CHECK CONSTRAINT [FK_ТехногенныйОбъект_ГеологическаяТочка]
GO

ALTER TABLE [dbo].[ТехногенныйОбъект]  WITH CHECK ADD  CONSTRAINT [FK_ТехногенныйОбъект_НазначениеЗемель] FOREIGN KEY([КодТипаНазначенияЗемель])
REFERENCES [dbo].[НазначениеЗемель] ([КодНазначенияЗемель])
GO

ALTER TABLE [dbo].[ТехногенныйОбъект] CHECK CONSTRAINT [FK_ТехногенныйОбъект_НазначениеЗемель]
GO

ALTER TABLE [dbo].[ТехногенныйОбъект]  WITH CHECK ADD  CONSTRAINT [FK_ТехногенныйОбъект_ТипТехногенногоОбъекта] FOREIGN KEY([КодТипаТехногенногоОбъекта])
REFERENCES [dbo].[ТипТехногенногоОбъекта] ([КодТипаТехногенногоОбъекта]);
GO

ALTER TABLE [dbo].[ТехногенныйОбъект] CHECK CONSTRAINT [FK_ТехногенныйОбъект_ТипТехногенногоОбъекта];
GO

---- Вставка первоначальных данных в таблицу -- Техногенный объект
INSERT INTO	[dbo].[ТехногенныйОбъект](
					[КодТехногенногоОбъекта],
					[КодОпорнойТочки],
					[КодТипаТехногенногоОбъекта],
					[КодТипаНазначенияЗемель],
					[НаименованиеТехногенногоОбъекта],
					[АдресТехногенногоОбъекта]) 
		VALUES(1, 1, 1, 2, 'АЗС-28', 'г. Слуцк, ул. Строителей, 27');
GO

---- Создание таблицы -- Природоохранный объект 
------------------------------------------------------------------------------------------------------
---------------------- Уточнить схему данных для природоохранного объекта!!!!
------------------------------------------------------------------------------------------------------
CREATE TABLE [dbo].[ПриродоохранныйОбъект](
	[КодПриродоохранногоОбъекта] [int] NOT NULL,
	[НаименованиеПриродоохранногоОбъекта] [nvarchar](50) NOT NULL,
	[КодТипаПриродоохранногоОбъекта] [int] NOT NULL,
 CONSTRAINT [PK_КодПриродоохранногоОбъекта] PRIMARY KEY ([КодПриродоохранногоОбъекта]))
GO

---- Вставка первоначальных данных в таблицу -- Природоохранные объекты
INSERT INTO [dbo].[ПриродоохранныйОбъект] ([КодПриродоохранногоОбъекта],[НаименованиеПриродоохранногоОбъекта],[КодТипаПриродоохранногоОбъекта]) VALUES(1,'Беловежская пуща', 3);
GO

---- Создание таблицы -- Инцидент
CREATE TABLE [dbo].[Инцидент](
	[КодИнцидента] [int] NOT NULL,
	[КодТипа] [int] NULL,
	[Дата] [datetime] NULL,
	[ДатаСообщения] [datetime] NULL,
	CONSTRAINT [PK_КодИнцидента] PRIMARY KEY ([КодИнцидента]));
GO

------------------------------------------------------------------------------------------------------
----- Возможны изменения структуры таблицы -----------------------------------------------------------
	--[КодИнцидента] [int] NOT NULL,
	--[ДатаПоступленияСообщения] [datetime2](7) NOT NULL,
	--[КодТипа] [int] NOT NULL,
	--[КодОбъекта] [int] NULL,
	--[ОбъемННП] [int] NOT NULL,
	--[ПогодныеУсловияТемпература] [int] NULL,
	--[Примечания] [nvarchar](max) NULL
------------------------------------------------------------------------------------------------------

---- Вставка первоначальных данных в таблицу -- Инцидент 
---------------------- Уточнить данные для вставки!!!!
INSERT INTO [dbo].[Инцидент]([КодТипа],[Дата],[ДатаСообщения]) VALUES ();
GO

