----------------- —оздание таблиц базы данных -------------------------------
----			Ѕудут созданы таблицы объектов
---- ќпорна€ геологическа€ точка
---- “ехногенный объект  
---- ѕриродоохранный объект
---- »нцидент    

------------------------------------------------------------------------------
USE EGH;
GO

DROP TABLE dbo.ќпорна€√еологическа€“очка;
DROP TABLE dbo.“ехногенныйќбъект;
DROP TABLE dbo.ѕриродоохранныйќбъект;
DROP TABLE dbo.»нцидент;

--- —оздание таблицы -- √еологическа€ “очка
------------------------------------------------------------------------------------------------------
---------------------- ”точнить схему данных дл€ точки!!!!  оординаты!!!!!
------------------------------------------------------------------------------------------------------
create TABLE [dbo].[ќпорна€√еологическа€“очка](
	[Idќпорной√еологической“очки] [int] NOT NULL,
	[Ўирота√рад] [float] NOT NULL,
	[ƒолгота√рад] [float] NOT NULL,
	[“ип√рунта] [int] NOT NULL,
	[√лубина√рунтовых¬од] [float] NOT NULL,
	[¬ысота”ровнемћор€] [float] NOT NULL
 CONSTRAINT [PK_√еологическа€“очка] PRIMARY KEY CLUSTERED ([Idќпорной√еологической“очки]));
GO

ALTER TABLE [dbo].[ќпорна€√еологическа€“очка]  WITH CHECK ADD CONSTRAINT [FK_ќпорна€√еологическа€“очка_“ип√рунта] FOREIGN KEY([“ип√рунта])
REFERENCES [dbo].[“ип√рунта] ([ од“ипа√рунта]);
GO

ALTER TABLE [dbo].[ќпорна€√еологическа€“очка] CHECK CONSTRAINT [FK_ќпорна€√еологическа€“очка_“ип√рунта];
GO
--- —оздание таблицы -- “ехногенный объект
------------------------------------------------------------------------------------------------------
---------------------- ”точнить схему данных дл€ “ехногенного объекта!!!!
------------------------------------------------------------------------------------------------------
CREATE TABLE [dbo].[“ехногенныйќбъект](
	[Id“ехногенногоќбъекта] int NOT NULL,
	[ од“ипа“ехногенногоќбъекта] int NOT NULL,
	[ од“ипаЌазначени€«емель] int NOT NULL,
	[Ќаименование“ехногенногоќбъекта] nvarchar(max) NOT NULL,
	[јдрес“ехногенногоќбъекта] nvarchar(max) NOT NULL,
	[Ўирота√рад] float NOT NULL,
	[ƒолгота√рад] float NOT NULL,
	[“ип√рунта] int NOT NULL,
	[√лубина√рунтовых¬од] float NOT NULL,
	[¬ысота”ровнемћор€]  float NOT NULL
 CONSTRAINT [PK_“ехногенныйќбъект] PRIMARY KEY CLUSTERED ([Id“ехногенногоќбъекта]));
GO

ALTER TABLE [dbo].[“ехногенныйќбъект]  WITH CHECK ADD  CONSTRAINT [FK_“ехногенныйќбъект_Ќазначение«емель] FOREIGN KEY([ од“ипаЌазначени€«емель])
REFERENCES [dbo].[Ќазначение«емель] ([ одЌазначени€«емель])
GO

ALTER TABLE [dbo].[“ехногенныйќбъект] CHECK CONSTRAINT [FK_“ехногенныйќбъект_Ќазначение«емель]
GO

ALTER TABLE [dbo].[“ехногенныйќбъект]  WITH CHECK ADD  CONSTRAINT [FK_“ехногенныйќбъект_“ип“ехногенногоќбъекта] FOREIGN KEY([ од“ипа“ехногенногоќбъекта])
REFERENCES [dbo].[“ип“ехногенногоќбъекта] ([ од“ипа“ехногенногоќбъекта]);
GO

ALTER TABLE [dbo].[“ехногенныйќбъект] CHECK CONSTRAINT [FK_“ехногенныйќбъект_“ип“ехногенногоќбъекта];
GO

ALTER TABLE [dbo].[“ехногенныйќбъект]  WITH CHECK ADD  CONSTRAINT [FK_“ехногенныйќбъект_“ип√рунта] FOREIGN KEY([“ип√рунта])
REFERENCES [dbo].[“ип√рунта] ([ од“ипа√рунта]);
GO

ALTER TABLE [dbo].[“ехногенныйќбъект] CHECK CONSTRAINT [FK_“ехногенныйќбъект_“ип√рунта];
GO


---- —оздание таблицы -- ѕриродоохранный объект 
------------------------------------------------------------------------------------------------------
---------------------- ”точнить схему данных дл€ природоохранного объекта!!!!
------------------------------------------------------------------------------------------------------
CREATE TABLE [dbo].[ѕриродоохранныйќбъект](
	[Idѕриродоохранногоќбъекта] int NOT NULL,
	[Ќаименованиеѕриродоохранногоќбъекта] nvarchar(50) NOT NULL,
	[ од“ипаѕриродоохранногоќбъекта] int NOT NULL,
	[ од“ипаЌазначени€«емель] int NOT NULL,
	[Ўирота√рад] float NOT NULL,
	[ƒолгота√рад] float NOT NULL,
	[“ип√рунта] int NOT NULL,
	[√лубина√рунтовых¬од] float NOT NULL,
	[¬ысота”ровнемћор€] float NOT NULL
 CONSTRAINT [PK_Idѕриродоохранногоќбъекта] PRIMARY KEY ([Idѕриродоохранногоќбъекта]))
GO

ALTER TABLE [dbo].[ѕриродоохранныйќбъект]  WITH CHECK ADD  CONSTRAINT [FK_ѕриродоохранныйќбъект_Ќазначение«емель] FOREIGN KEY([ од“ипаЌазначени€«емель])
REFERENCES [dbo].[Ќазначение«емель] ([ одЌазначени€«емель])
GO

ALTER TABLE [dbo].[ѕриродоохранныйќбъект] CHECK CONSTRAINT [FK_ѕриродоохранныйќбъект_Ќазначение«емель]
GO

ALTER TABLE [dbo].[ѕриродоохранныйќбъект]  WITH CHECK ADD  CONSTRAINT [FK_ѕриродоохранныйќбъект_“ип√рунта] FOREIGN KEY([“ип√рунта])
REFERENCES [dbo].[“ип√рунта] ([ од“ипа√рунта])
GO

ALTER TABLE [dbo].[ѕриродоохранныйќбъект] CHECK CONSTRAINT [FK_ѕриродоохранныйќбъект_“ип√рунта]
GO

ALTER TABLE [dbo].[ѕриродоохранныйќбъект]  WITH CHECK ADD  CONSTRAINT [FK_ѕриродоохранныйќбъект_“ипѕриродоохранногоќбъекта] FOREIGN KEY([ од“ипаѕриродоохранногоќбъекта])
REFERENCES [dbo].[“ипѕриродоохранногоќбъекта] ([ од“ипаѕриродоохранногоќбъекта])
GO

ALTER TABLE [dbo].[ѕриродоохранныйќбъект] CHECK CONSTRAINT [FK_ѕриродоохранныйќбъект_“ипѕриродоохранногоќбъекта]
GO

---- —оздание таблицы -- »нцидент
CREATE TABLE [dbo].[»нцидент](
	[Id»нцидента] int NOT NULL,
	[ од“ипа»нцидента] int NULL,
	[ƒата] datetime NULL,
	[ƒата—ообщени€] datetime NULL,
	[ од“ипаЌазначени€«емель] int NOT NULL,
	[Ўирота√рад] float NOT NULL,
	[ƒолгота√рад] float NOT NULL,
	[“ип√рунта] int NOT NULL,
	[√лубина√рунтовых¬од] float NOT NULL,
	[¬ысота”ровнемћор€] float NOT NULL
	CONSTRAINT [PK_Id»нцидента] PRIMARY KEY ([Id»нцидента]));
GO
ALTER TABLE [dbo].[»нцидент]  WITH CHECK ADD  CONSTRAINT [FK_»нцидент_Ќазначение«емель] FOREIGN KEY([ од“ипаЌазначени€«емель])
REFERENCES [dbo].[Ќазначение«емель] ([ одЌазначени€«емель])
GO

ALTER TABLE [dbo].[»нцидент] CHECK CONSTRAINT [FK_»нцидент_Ќазначение«емель]
GO

ALTER TABLE [dbo].[»нцидент]  WITH CHECK ADD  CONSTRAINT [FK_»нцидент_“ип√рунта] FOREIGN KEY([“ип√рунта])
REFERENCES [dbo].[“ип√рунта] ([ од“ипа√рунта])
GO

ALTER TABLE [dbo].[»нцидент] CHECK CONSTRAINT [FK_»нцидент_“ип√рунта]
GO

ALTER TABLE [dbo].[»нцидент]  WITH CHECK ADD  CONSTRAINT [FK_»нцидент_“ип»нцидента] FOREIGN KEY([ од“ипа»нцидента])
REFERENCES [dbo].[“ип»нцидента] ([ од“ипа])
GO

ALTER TABLE [dbo].[»нцидент] CHECK CONSTRAINT [FK_»нцидент_“ип»нцидента]
GO
------------------------------------------------------------------------------------------------------
----- ¬озможны изменени€ структуры таблицы -----------------------------------------------------------
	--[ од»нцидента] [int] NOT NULL,
	--[ƒатаѕоступлени€—ообщени€] [datetime2](7) NOT NULL,
	--[ од“ипа] [int] NOT NULL,
	--[ одќбъекта] [int] NULL,
	--[ќбъемЌЌѕ] [int] NOT NULL,
	--[ѕогодные”слови€“емпература] [int] NULL,
	--[ѕримечани€] [nvarchar](max) NULL
------------------------------------------------------------------------------------------------------
---------------------------------------------------------------------------------------------------------
---- —оздание таблицы “ехногенный ќбъект
CREATE TABLE [dbo].[“ехногенныйќбъект](
	[Id“ехногенногоќбъекта] [int] NOT NULL,
	[ од“ипа“ехногенногоќбъекта] [int] NOT NULL,
	[ од“ипаЌазначени€«емель] [int] NOT NULL,
	[Ќаименование“ехногенногоќбъекта] [nvarchar](max) NOT NULL,
	[јдрес“ехногенногоќбъекта] [nvarchar](max) NULL,
	[Ўирота√рад] [float] NOT NULL,
	[ƒолгота√рад] [float] NOT NULL,
	[“ип√рунта] [int] NOT NULL,
	[√лубина√рунтовых¬од] [float] NULL,
	[¬ысота”ровнемћор€] [float] NULL,
 CONSTRAINT [PK_“ехногенныйќбъект] PRIMARY KEY CLUSTERED 
(
	[Id“ехногенногоќбъекта] ASC
)WITH (PAD_INDEX = OFF, STATISTICS_NORECOMPUTE = OFF, IGNORE_DUP_KEY = OFF, ALLOW_ROW_LOCKS = ON, ALLOW_PAGE_LOCKS = ON) ON [PRIMARY]
) ON [PRIMARY] TEXTIMAGE_ON [PRIMARY]

GO

ALTER TABLE [dbo].[“ехногенныйќбъект]  WITH CHECK ADD  CONSTRAINT [FK_“ехногенныйќбъект_Ќазначение«емель] FOREIGN KEY([ од“ипаЌазначени€«емель])
REFERENCES [dbo].[Ќазначение«емель] ([ одЌазначени€«емель])
GO

ALTER TABLE [dbo].[“ехногенныйќбъект] CHECK CONSTRAINT [FK_“ехногенныйќбъект_Ќазначение«емель]
GO

ALTER TABLE [dbo].[“ехногенныйќбъект]  WITH CHECK ADD  CONSTRAINT [FK_“ехногенныйќбъект_“ип√рунта] FOREIGN KEY([“ип√рунта])
REFERENCES [dbo].[“ип√рунта] ([ од“ипа√рунта])
GO

ALTER TABLE [dbo].[“ехногенныйќбъект] CHECK CONSTRAINT [FK_“ехногенныйќбъект_“ип√рунта]
GO

ALTER TABLE [dbo].[“ехногенныйќбъект]  WITH CHECK ADD  CONSTRAINT [FK_“ехногенныйќбъект_“ип“ехногенногоќбъекта] FOREIGN KEY([ од“ипа“ехногенногоќбъекта])
REFERENCES [dbo].[“ип“ехногенногоќбъекта] ([ од“ипа“ехногенногоќбъекта])
GO

ALTER TABLE [dbo].[“ехногенныйќбъект] CHECK CONSTRAINT [FK_“ехногенныйќбъект_“ип“ехногенногоќбъекта]
GO
