----------------- Создание процедур базы данных -----------------------------
----		Будут созданы следующие процедуры
---- Техногенный объект    
-----------------------------------------------------------------------------
---- Добавление техногенного объекта
---- Удаление техногенного объекта 
---- Получение техногенного объекта по ID 
---- Получение списка техногенных объектов 
---- Обновление техногенного объекта
---- Получение следующего ID техногенного объекта
-----------------------------------------------------------------------------
USE EGH;



